Tekla Open API Reference for Tekla Structures 2025
IdNumber Methods
The ObjectFilterExpressions.IdNumber type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
ObjectFilterExpressions.IdNumber Class
Tekla.Structures.Filtering.Categories Namespace